fundamental_twod_motion/wake_capture_2d_job_pack/Re100.0_stroke9.0_acf0.25_pf0.125/backGround/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }

    wing
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }

    farField
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }

}

// ************************************************************************* //
